tests/example-soap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <RegisterTCRRequest xmlns="https://efi.tax.gov.me/fs/schema"
                            xmlns:ns2="http://www.w3.org/2000/09/xmldsig#" Id="Request" Version="1">
            <Header SendDateTime="2021-05-22T13:21:01+01:00" UUID="53f0616c-3078-4678-8716-59353e7475ee"/>
            <TCR BusinUnitCode="abc123" IssuerTIN="1111111" MaintainerCode="abc633543" SoftCode="jgh6554" TCRIntID="1"
                 ValidFrom="2021-05-21" Type="REGULAR"/>
        </RegisterTCRRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

