test.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <RegisterInvoiceRequest xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">
            <Header UUID="c89fbc4f-1d84-4a45-95ba-452df3445125" SendDateTime="2020-11-19T01:44:18+01:00"/>
            <Invoice 
                TypeOfInv="NONCASH" 
                IsSimplifiedInv="false" 
                IssueDateTime="2020-11-19T01:44:18+01:00" 
                InvNum="db891qz567/20/2020" 
                InvOrdNum="20" 
                IsIssuerInVAT="true" 
                TotPriceWoVAT="309.55" 
                TotVATAmt="65.01" 
                TotPrice="374.56" 
                OperatorCode="xg149gu972" 
                BusinUnitCode="db891qz567" 
                SoftCode="ge788jm169" 
                IIC="877dd5a09e7a6a0100f058116bebb8c7" 
                IICSignature="8a088d49d080a392400aa9a7039852ef1ba175ecdcc4a4837f9ab2ce02cb61708082ed28d20e722f05a37bd082ef877f269394c705bfbf2f0012c55df4cec10991812155a70762e0481a3295f57e66ccff50b433fd0f553953ecc7e4ec482345de183418a24d0888d64e28247ef5cc1f7129eaf71d4db9b1dabdab5d3f1aef94df18d9ed95d296716577aae116214885f4f0b4b3ee3988f5e6230366d54cfb2d943158115aa64fc83f6eda07e0d7981cb2a58b26068efa714d03d1ca4f46b11ac585a2e44f5febf941c85e310a8fa9f2d7b0882486a4c00b80844288a0895523e477c0dcab73fcef42df5dadb3c136a3a8706d1f3285fb257ee7ee677e0a4759" 
                IsReverseCharge="false">
                <SupplyDateOrPeriod Start="2020-11-19" End="2020-11-19"/>
                <PayMethods>
                    <PayMethod Type="ACCOUNT" Amt="374.56"/>
                </PayMethods>
                <Seller IDType="TIN" IDNum="03036286" Name="NOSHTO D.O.O." Address="Cetinjski put bb" Town="Podgorica" Country="MNE"/>
                <Buyer IDType="TIN" IDNum="03036286" Name="NOSHTO d.o.o."/>
                <Items>
                    <I N="Advance payment for doing something" U="unit" Q="1.00" UPB="130.15" UPA="157.48" RR="true" PB="130.15" VR="21.00" VA="27.33" PA="157.48"/>
                    <I N="Advance payment for doing something else" U="unit" Q="1.00" UPB="179.40" UPA="217.07" RR="true" PB="179.40" VR="21.00" VA="37.67" PA="217.07"/>
                </Items>
                <SameTaxes>
                    <SameTax NumOfItems="2" PriceBefVAT="309.55" VATRate="21.00" VATAmt="65.01"/>
                </SameTaxes>
            </Invoice>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                <SignedInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
                    <Reference URI="#Request">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
                        <DigestValue></DigestValue>
                    </Reference>
                </SignedInfo>
                <SignatureValue></SignatureValue>
                <KeyInfo>
                    <X509Data>
                        <X509Certificate></X509Certificate>
                        <X509SubjectName></X509SubjectName>
                    </X509Data>
                </KeyInfo>
            </Signature>
        </RegisterInvoiceRequest>
    </s:Body>
</s:Envelope>
