public/signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Header/>
            <soapenv:Body><RegisterInvoiceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">
    <Header SendDateTime="2021-05-09T13:47:22+02:00" UUID="eec56c0f-7dd6-44c2-a296-65438ad0f8ce"/>
    <Invoice TypeOfInv="CASH" IsSimplifiedInv="false" IssueDateTime="2021-05-09T13:47:22+02:00" InvNum="ya260ri698/77/2021/wp886vu280" InvOrdNum="77" TCRCode="wp886vu280" IsIssuerInVAT="true" TotPriceWoVAT="299.87" TotVATAmt="44.13" TotPrice="344.00" OperatorCode="ia871me776" BusinUnitCode="ya260ri698" SoftCode="qk433mq872" IIC="45569dd8416bf19abe6b13c8eaccd9cc" IICSignature="8a47e3c0b39a9c5548d9437c13bfb54b391a15badee77e278c2f470d38ae83736a71a1f1bcf59defe349bab50e56765c7b220ee9a4613399f2dfb039def782a62d869e8144916858be53bbf8112ab6a7b75f73acaf5c8801ad1425a687ad24db404dab92c932414b0502412ba47b553d27d4078d2e22997b8b1cbe6c0a6b05b1d7f3aeb01831c6b142a7226da802d2ce19c0a55ac1414683bbb2caa4f447e1447cdf1aaff451f9322873483cced24042f74f2ded9a3d6515221e5267e5e3775471e0f74d8e61837b3d05c407ec3e98840d67826a01f97bb596f2bac4ddc92c73431dfa3642d84d3fe6f692da969a6e8a6ad033dbbee869f2834c6531e1fb62a0" IsReverseCharge="false">
        <PayMethods>
            <PayMethod Type="BANKNOTE" Amt="344.00"/>
        </PayMethods>

        <Seller IDType="TIN" IDNum="02829258" Name="Drvoimpex-Bams"/>

        <Buyer IDType="TIN" IDNum="12345678" Name="Anonimni Kupac"/>

        <Items>
                            <I N="eos" C="0" U="kom" Q="5.00" UPB="33.06" UPA="40.00" R="0.00" RR="1" PB="165.29" VR="0.21" VA="34.71" PA="200.00"/>
                            <I N="vel" C="0" U="m" Q="12.00" UPB="11.22" UPA="12.00" R="0.00" RR="1" PB="134.58" VR="0.07" VA="9.42" PA="144.00"/>
                    </Items>


        <SameTaxes>
                                                                            <SameTax NumOfItems="1" PriceBefVAT="134.58" VATRate="7.00" VATAmt="9.42"/>
                                                                <SameTax NumOfItems="1" PriceBefVAT="165.29" VATRate="21.00" VATAmt="34.71"/>
                                    </SameTaxes>
    </Invoice>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
  <SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
  <Reference URI="#Request"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><DigestValue>Lpd2UIJv74Pek6Nz9V7SGUpuuU/HIbyPeWuUujEIjkI=</DigestValue></Reference></SignedInfo><SignatureValue>CJhUoY6gxkHRHT3YcNaGX9T7uveLiD83f0wyO+Xz0nLQholDagiceg/pSgQD8nrrzfXtv0Hcj5ls6Eic1AiT/z9Fc7xkJL8XrmSn8IR+AnQz9chZp6zQEpB3nCR/8idtIM0W5HswnwUULP+M0n7AZu4x1lqtzdQOQ25Xu//L8O0Hv2AxKAmnvlzNGw94tx3CV7fW3i5Ji8dksyRo7OYvKnrPin+EYRNq74kgw9EAumjtNyTBwj5V5U5NPvDW+YkwVtOb3dgEeY5qKgsLLk1fpB8RQPfesQRPWArudlTkWbpUM/km9CnP8meAmA81MX3X0MPnU6uCbr/TMyhWnBc8Yg==</SignatureValue>
<KeyInfo><X509Data><X509Certificate>MIIHHTCCBYWgAwIBAgIEXQMMRjANBgkqhkiG9w0BAQsFADA0MQswCQYDVQQGEwJt
ZTEQMA4GA1UEChMHUG9zdGFDRzETMBEGA1UEAxMKUG9zdGFDRyBDQTAeFw0yMTAx
MTIwNzEzMDVaFw0yNDAxMTIwNzQzMDVaMIGAMQswCQYDVQQGEwJNRTEUMBIGA1UE
CxMLUHJhdm5vIGxpY2UxMTAVBgNVBGETDlZBVE1FLTAyODI5MjU4MBgGA1UEChMR
UkVTVEFSVCBJVCBkLm8uby4xKDAMBgNVBAUTBTQyODY0MBgGA1UEAxMRUkVTVEFS
VCBJVCBkLm8uby4wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQC0u6vT
75aX4Etzpo/RU8afyOoWQUe+FmpL7sL/jpJFPMte6OMgbms3qqWRYsgR2oJ2YU9d
mHZV7Cy+EEbdfV73IkIStkJuLyHHT+kxkp+dXLcykEe23e7VLnkCPzJ2nU4HUs4G
S6fTth4Z36srmgcFfJz3LHy8ii80/753A5sEjKWDbjrnvyTYr1v3i4WjGS61tqcW
LFdst9K7y5PiGB3KZeGkG0qg7iYLHTmo27ekVyNjAlgFiR/xNURM+hOJCH0DTHS5
SJ5VvdQ3PMczL74VEXKye6MgDtMeBH9UEZPOFsaOaqT4dfq+FL/Kd65a+qDFAez0
eZGcyPoWqa7rC8VRAgMBAAGjggNoMIIDZDAOBgNVHQ8BAf8EBAMCBsAwRQYDVR0g
BD4wPDA6BgwrBgEEAYKfAQEGAQQwKjAoBggrBgEFBQcCARYcaHR0cDovL3d3dy5w
b3N0YWNnLWNhLm1lL2NwczCBsgYIKwYBBQUHAQMEgaUwgaIwCAYGBACORgEBMIGA
BgYEAI5GAQUwdjA5FjNodHRwczovL3d3dy5wb3N0YWNnLWNhLm1lL2Nwcy9wb3N0
YWNnLWNhX3Bkc19lbi5wZGYTAmVuMDkWM2h0dHBzOi8vd3d3LnBvc3RhY2ctY2Eu
bWUvY3BzL3Bvc3RhY2ctY2FfcGRzX3NyLnBkZhMCc3IwEwYGBACORgEGMAkGBwQA
jkYBBgIwTgYIKwYBBQUHAQEEQjBAMD4GCCsGAQUFBzAChjJodHRwOi8vd3d3LnBv
c3RhY2ctY2EubWUvY2VyL1Bvc3RhQ0ctQ0FfY2FjZXJ0LmNlcjCBgAYDVR0SBHkw
d6R1MHMxCzAJBgNVBAYTAk1FMTYwNAYDVQQKEy1QT1NUQSBDUk5FIEdPUkUgQUtD
SU9OQVJTS08gRFJVU1RWTyBQT0RHT1JJQ0ExFzAVBgNVBGETDlZBVE1FLTAyODY3
OTQwMRMwEQYDVQQDEwpQb3N0YUNHIENBMIIBQQYDVR0fBIIBODCCATQwTKBKoEik
RjBEMQswCQYDVQQGEwJtZTEQMA4GA1UEChMHUG9zdGFDRzETMBEGA1UEAxMKUG9z
dGFDRyBDQTEOMAwGA1UEAxMFQ1JMNDUwgeOggeCggd2GW2xkYXA6Ly9sZGFwLnBv
c3RhY2ctY2EubWUvY249UG9zdGFDRyUyMENBLG89UG9zdGFDRyxjPW1lP2NlcnRp
ZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnmGPmh0dHA6Ly9laWQucG9zdGFj
Zy1jYS5tZS9jcmwvcG9zdGFjZ19jYV9wb3N0YWNnX21lX2NybGZpbGUuY3Jshj5o
dHRwOi8vd3d3LnBvc3RhY2ctY2EubWUvY3JsL3Bvc3RhY2dfY2FfcG9zdGFjZ19t
ZV9jcmxmaWxlLmNybDAfBgNVHSMEGDAWgBR3Y0xYMrlU0RoJ93Quq6uNPKoq8TAd
BgNVHQ4EFgQUV5q+2TeanEdIUlZlVxS81r6WkOwwDQYJKoZIhvcNAQELBQADggGB
AOBXnwm3bozLpkES2WypmCFHkFrNBmz9nm6XoLBsGx7uRcqRGsquQLVlAB/IRa+b
N14vQ6Vulcw9zv7kqDZFhi1txuWpvuxSZpx621EgZtIVDMUITmU8q9ezqNor7UgS
DhhfvIF6ZTkPM1UmBZpPMyLUtcxgZ1l3guZwu00ClcUQpb3S4710aM8CoFBGKHE9
65GXhSlriw0MUX0cgVANqV0FyKyuIOes2Lc7N0dHGKwKU8XbSziUaf+59Unigm5C
HxcT3ZvvMxl/+M65Whw4dkkajoeobpCm3YKuUb26/evjuH7EWki9dgKLQ1qSoDmQ
dDxIaNqK9c0hfbislxx3hrQcqQ9K/34Jr3sdS4Tq8142GRYoclKGebU62ds51a43
YfXo308Nx2mDsu6gd6yZvLP7JWBNB2Dvtc7bJHtciEOUtr5UN+AANgKG69JRRK4e
W4lhSwPSMKscth2PsAw0+hfi1i3aSThj6tTVrZLsnliMtrANXRJLETV9cbx7Ohzb
Sw==
</X509Certificate></X509Data></KeyInfo></Signature></RegisterInvoiceRequest>
</soapenv:Body>
            </soapenv:Envelope>